espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_prcm.h
// Field:    [18] PKA_AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides PKA_CLK_EN, SECDMACLKGS.PKA_CLK_EN and SECDMACLKGDS.PKA_CLK_EN
// when enabled.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_PKA_AM_CLK_EN                              0x00040000
#define PRCM_SECDMACLKGR_PKA_AM_CLK_EN_BITN                                 18
#define PRCM_SECDMACLKGR_PKA_AM_CLK_EN_M                            0x00040000
#define PRCM_SECDMACLKGR_PKA_AM_CLK_EN_S                                    18

// Field:    [17] TRNG_AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides TRNG_CLK_EN, SECDMACLKGS.TRNG_CLK_EN and SECDMACLKGDS.TRNG_CLK_EN
// when enabled.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_TRNG_AM_CLK_EN                             0x00020000
#define PRCM_SECDMACLKGR_TRNG_AM_CLK_EN_BITN                                17
#define PRCM_SECDMACLKGR_TRNG_AM_CLK_EN_M                           0x00020000
#define PRCM_SECDMACLKGR_TRNG_AM_CLK_EN_S                                   17

// Field:    [16] CRYPTO_AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides CRYPTO_CLK_EN, SECDMACLKGS.CRYPTO_CLK_EN and
// SECDMACLKGDS.CRYPTO_CLK_EN when enabled.
//
// SYSBUS clock will always run when enabled
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_CRYPTO_AM_CLK_EN                           0x00010000
#define PRCM_SECDMACLKGR_CRYPTO_AM_CLK_EN_BITN                              16
#define PRCM_SECDMACLKGR_CRYPTO_AM_CLK_EN_M                         0x00010000
#define PRCM_SECDMACLKGR_CRYPTO_AM_CLK_EN_S                                 16

// Field:     [8] DMA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by DMA_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_DMA_CLK_EN                                 0x00000100
#define PRCM_SECDMACLKGR_DMA_CLK_EN_BITN                                     8
#define PRCM_SECDMACLKGR_DMA_CLK_EN_M                               0x00000100
#define PRCM_SECDMACLKGR_DMA_CLK_EN_S                                        8

// Field:     [2] PKA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by PKA_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_PKA_CLK_EN                                 0x00000004
#define PRCM_SECDMACLKGR_PKA_CLK_EN_BITN                                     2
#define PRCM_SECDMACLKGR_PKA_CLK_EN_M                               0x00000004
#define PRCM_SECDMACLKGR_PKA_CLK_EN_S                                        2

// Field:     [1] TRNG_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by TRNG_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_TRNG_CLK_EN                                0x00000002
#define PRCM_SECDMACLKGR_TRNG_CLK_EN_BITN                                    1
#define PRCM_SECDMACLKGR_TRNG_CLK_EN_M                              0x00000002
#define PRCM_SECDMACLKGR_TRNG_CLK_EN_S                                       1

// Field:     [0] CRYPTO_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by CRYPTO_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN                              0x00000001
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN_BITN                                  0
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN_M                            0x00000001
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN_S                                     0

//*****************************************************************************
//
// Register: PRCM_O_SECDMACLKGS
//
//*****************************************************************************
// Field:     [8] DMA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SECDMACLKGR.DMA_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGS_DMA_CLK_EN                                 0x00000100
#define PRCM_SECDMACLKGS_DMA_CLK_EN_BITN                                     8
#define PRCM_SECDMACLKGS_DMA_CLK_EN_M                               0x00000100
#define PRCM_SECDMACLKGS_DMA_CLK_EN_S                                        8

// Field:     [2] PKA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SECDMACLKGR.PKA_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGS_PKA_CLK_EN                                 0x00000004
#define PRCM_SECDMACLKGS_PKA_CLK_EN_BITN                                     2
#define PRCM_SECDMACLKGS_PKA_CLK_EN_M                               0x00000004
#define PRCM_SECDMACLKGS_PKA_CLK_EN_S                                        2

// Field:     [1] TRNG_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SECDMACLKGR.TRNG_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGS_TRNG_CLK_EN                                0x00000002
#define PRCM_SECDMACLKGS_TRNG_CLK_EN_BITN                                    1
#define PRCM_SECDMACLKGS_TRNG_CLK_EN_M                              0x00000002
#define PRCM_SECDMACLKGS_TRNG_CLK_EN_S                                       1

// Field:     [0] CRYPTO_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SECDMACLKGR.CRYPTO_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN                              0x00000001
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN_BITN                                  0
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN_M                            0x00000001
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN_S                                     0

//*****************************************************************************
//
// Register: PRCM_O_SECDMACLKGDS
//
//*****************************************************************************
// Field:     [8] DMA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SECDMACLKGR.DMA_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGDS_DMA_CLK_EN                                0x00000100
#define PRCM_SECDMACLKGDS_DMA_CLK_EN_BITN                                    8
#define PRCM_SECDMACLKGDS_DMA_CLK_EN_M                              0x00000100
#define PRCM_SECDMACLKGDS_DMA_CLK_EN_S                                       8

// Field:     [2] PKA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by SECDMACLKGR.PKA_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGDS_PKA_CLK_EN                                0x00000004
#define PRCM_SECDMACLKGDS_PKA_CLK_EN_BITN                                    2
#define PRCM_SECDMACLKGDS_PKA_CLK_EN_M                              0x00000004
#define PRCM_SECDMACLKGDS_PKA_CLK_EN_S                                       2

// Field:     [1] TRNG_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// SYSBUS clock will always run when enabled
//
// Can be forced on by SECDMACLKGR.TRNG_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN                               0x00000002
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN_BITN                                   1
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN_M                             0x00000002
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN_S                                      1

// Field:     [0] CRYPTO_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// SYSBUS clock will always run when enabled
//
// Can be forced on by SECDMACLKGR.CRYPTO_AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN                             0x00000001
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN_BITN                                 0
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN_M                           0x00000001
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN_S                                    0

//*****************************************************************************
//
// Register: PRCM_O_GPIOCLKGR
//
//*****************************************************************************
// Field:     [8] AM_CLK_EN
//
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides CLK_EN,  GPIOCLKGS.CLK_EN and  GPIOCLKGDS.CLK_EN when enabled.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_GPIOCLKGR_AM_CLK_EN                                    0x00000100
#define PRCM_GPIOCLKGR_AM_CLK_EN_BITN                                        8
#define PRCM_GPIOCLKGR_AM_CLK_EN_M                                  0x00000100
#define PRCM_GPIOCLKGR_AM_CLK_EN_S                                           8

// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_GPIOCLKGR_CLK_EN                                       0x00000001
#define PRCM_GPIOCLKGR_CLK_EN_BITN                                           0
#define PRCM_GPIOCLKGR_CLK_EN_M                                     0x00000001
#define PRCM_GPIOCLKGR_CLK_EN_S                                              0

//*****************************************************************************
//
// Register: PRCM_O_GPIOCLKGS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by GPIOCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_GPIOCLKGS_CLK_EN                                       0x00000001
#define PRCM_GPIOCLKGS_CLK_EN_BITN                                           0
#define PRCM_GPIOCLKGS_CLK_EN_M                                     0x00000001
#define PRCM_GPIOCLKGS_CLK_EN_S                                              0

//*****************************************************************************
//
// Register: PRCM_O_GPIOCLKGDS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// Can be forced on by GPIOCLKGR.AM_CLK_EN
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_GPIOCLKGDS_CLK_EN                                      0x00000001
#define PRCM_GPIOCLKGDS_CLK_EN_BITN                                          0
#define PRCM_GPIOCLKGDS_CLK_EN_M                                    0x00000001
#define PRCM_GPIOCLKGDS_CLK_EN_S                                             0

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKGR
//
//*****************************************************************************
// Field:  [11:8] AM_CLK_EN
//
// Each bit below has the following meaning:
//
// 0: No force
// 1: Force clock on for all modes (Run, Sleep and Deep Sleep)
//
// Overrides CLK_EN,  GPTCLKGS.CLK_EN and  GPTCLKGDS.CLK_EN when enabled.
//
// ENUMs can be combined
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// AM_GPT3                  Enable clock for GPT3  in all modes
// AM_GPT2                  Enable clock for GPT2  in all modes
// AM_GPT1                  Enable clock for GPT1  in all modes
// AM_GPT0                  Enable clock for GPT0 in all modes
#define PRCM_GPTCLKGR_AM_CLK_EN_W                                            4
#define PRCM_GPTCLKGR_AM_CLK_EN_M                                   0x00000F00
#define PRCM_GPTCLKGR_AM_CLK_EN_S                                            8
#define PRCM_GPTCLKGR_AM_CLK_EN_AM_GPT3                             0x00000800
#define PRCM_GPTCLKGR_AM_CLK_EN_AM_GPT2                             0x00000400
#define PRCM_GPTCLKGR_AM_CLK_EN_AM_GPT1                             0x00000200
#define PRCM_GPTCLKGR_AM_CLK_EN_AM_GPT0                             0x00000100

